<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Union
© ExploreAI Academy

In this exercise, we will explore different SQL union statements in order to cross-examine data contained in multiple tables in a dataset.

## Learning objectives

In this train, we will learn to:
- Use unions to stack the rows of similar tables.

First, let's load our database:

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

# Establish a connection to a SQLite database file.
%sql sqlite:///chinook.db

Connecting to 'sqlite:///chinook.db'

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/The%20chinook%20database%20ERD.jpeg"  style="width:70%";/>
<br>
<br>
    <em>Figure 1: The Chinook database ERD</em>
</div>

 <em> <a href="https://www.sqlitetutorial.net/sqlite-sample-database/">Image source</a></em>

## Exercises

### Exercise 1

Use the `UNION` operator to combine information from the tracks and albums tables into a single list.

In [11]:
%%sql

SELECT 
    t.albumID,
    t.Name,
    "Track" AS Category
FROM
    tracks AS t
UNION
SELECT
    a.albumID,
    a.Title,
    "Album" AS Album
FROM
    albums AS a

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------------------+----------+
| AlbumId |                   Name                  | Category |
+---------+-----------------------------------------+----------+
|    1    |            Breaking The Rules           |  Track   |
|    1    |                  C.O.D.                 |  Track   |
|    1    |                Evil Walks               |  Track   |
|    1    | For Those About To Rock (We Salute You) |  Track   |
|    1    |  For Those About To Rock We Salute You  |  Album   |
|    1    |             Inject The Venom            |  Track   |
|    1    |             Let's Get It Up             |  Track   |
|    1    |         Night Of The Long Knives        |  Track   |
|    1    |          Put The Finger On You          |  Track   |
|    1    |                Snowballed               |  Track   |
+---------+-----------------------------------------+----------+
Truncated to displaylimit of 10.

### Exercise 2

In some cases, artists will create eponymous albums, i.e. albums with the same name as the artist. Write a query that will highlight all eponymous albums as well as non-eponymous albums.


**NOTE**: At the moment, SQLite does not support the `FULL OUTER JOIN` statement. Emulate it using a `LEFT JOIN` and a `UNION` operator.

In [29]:
%%sql

SELECT 
    al.Title,
    ar.Name
FROM
    albums AS al
LEFT JOIN
    artists AS ar
WHERE
    al.Title = ar.Name

Running query in 'sqlite:///chinook.db'

+-------------------+-------------------+
|       Title       |        Name       |
+-------------------+-------------------+
|     Audioslave    |     Audioslave    |
|   Black Sabbath   |   Black Sabbath   |
|     Body Count    |     Body Count    |
|    Iron Maiden    |    Iron Maiden    |
|       Olodum      |       Olodum      |
|     Pearl Jam     |     Pearl Jam     |
|    Raul Seixas    |    Raul Seixas    |
|     The Doors     |     The Doors     |
|     Van Halen     |     Van Halen     |
|      Aquaman      |      Aquaman      |
| Temple of the Dog | Temple of the Dog |
+-------------------+-------------------+

In [15]:
%config SqlMagic.displaylimit = None

displaylimit: Value None will be treated as 0 (no limit)

## Solutions

### Exercise 1

The SQL query uses the `UNION` operator to merge data from two tables, `tracks` and `albums`, into a single list. It selects the `AlbumId` and `Name` columns from the `tracks` table with a "Category" label of "Artist" and combines it with the `AlbumId` and `Title` columns from the `albums` table with a "Category" label of "Album". The `LIMIT 10` clause is used to restrict the output to the first 10 results.

In [10]:
%%sql

SELECT t.AlbumId, t.Name, "Artist" AS "Category"
FROM tracks AS t

UNION

SELECT a.AlbumId, a.Title, "Album" AS "Category"
FROM albums AS a

Running query in 'sqlite:///chinook.db'

+---------+-----------------------------------------+----------+
| AlbumId |                   Name                  | Category |
+---------+-----------------------------------------+----------+
|    1    |            Breaking The Rules           |  Artist  |
|    1    |                  C.O.D.                 |  Artist  |
|    1    |                Evil Walks               |  Artist  |
|    1    | For Those About To Rock (We Salute You) |  Artist  |
|    1    |  For Those About To Rock We Salute You  |  Album   |
|    1    |             Inject The Venom            |  Artist  |
|    1    |             Let's Get It Up             |  Artist  |
|    1    |         Night Of The Long Knives        |  Artist  |
|    1    |          Put The Finger On You          |  Artist  |
|    1    |                Snowballed               |  Artist  |
+---------+-----------------------------------------+----------+
Truncated to displaylimit of 10.

### Exercise 2

The SQL query retrieves a list of artist names and album titles, highlighting both eponymous albums (albums with the same name as the artist) and non-eponymous albums. It achieves this by using a combination of `LEFT JOIN` and `UNION ALL` to combine the results of two separate queries. The first query joins the `artists` and `albums` tables by matching the artist's name with the album title, while the second query joins the `albums` and `artists` tables with the same condition. This approach effectively emulates a `FULL OUTER JOIN`, ensuring that all eponymous and non-eponymous albums are included in the final result.

In [26]:
%%sql

SELECT 
    ar.Name, 
    a.Title
FROM 
    artists ar
LEFT JOIN 
    albums AS a
    ON ar.Name = a.Title

INTERSECT

SELECT 
    ar.Name, 
    a.Title
FROM 
    albums AS a
LEFT JOIN 
    artists AS ar
    ON ar.Name = a.Title

Running query in 'sqlite:///chinook.db'

+-------------------+-------------------+
|        Name       |       Title       |
+-------------------+-------------------+
|      Aquaman      |      Aquaman      |
|     Audioslave    |     Audioslave    |
|   Black Sabbath   |   Black Sabbath   |
|     Body Count    |     Body Count    |
|    Iron Maiden    |    Iron Maiden    |
|       Olodum      |       Olodum      |
|     Pearl Jam     |     Pearl Jam     |
|    Raul Seixas    |    Raul Seixas    |
| Temple of the Dog | Temple of the Dog |
|     The Doors     |     The Doors     |
|     Van Halen     |     Van Halen     |
+-------------------+-------------------+

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>